#+TITLE: Homework 1 in R
#+AUTHOR: Matthew Lundquist
#+DATE: 2018-1-18

** Question 3

Exercises 3.1, 3.2, 3.3, and 3.5

Everything from these four exercises can be done manually on a calculator, manually in R, or
using built-in R functions 

I assume that you know how to use a calculator and you can use the basic =+, -, *, and /= functions in R.
Here are the built-in functions to answer these questions

3.1:

#+BEGIN_SRC R :session :results output :exports code

weights <- c(3.1, 3.4, 3.6, 3.7, 4.0) # Make data vector

sum(weights[1:4]) # 13.8
sum(weights[2:4]) # 10.7
sum(weights[1:5]) # 17.8
sum(weights) # 17.8

#+END_SRC

#+RESULTS:
: [1] 13.8
: [1] 10.7
: [1] 17.8
: [1] 17.8

3.2:

#+BEGIN_SRC R :session :results output :exports code

weights <- c(3.1, 3.4, 3.6, 3.7, 4.0) # Make data vector

mean(weights) # 3.56
median(weights) # 3.6

#+END_SRC

#+RESULTS:
: [1] 3.56
: [1] 3.6

3.3:

#+BEGIN_SRC R :session :results output :exports code

ages <- c(32.2, 37.5, 41.7, 53.8, 50.2, 48.2, 46.3, 65.0, 44.8)

mean(ages) # 46.63
sort(ages) # If you want to put them in order
median(ages) # 46.3

ages.2 <-  c(32.2, 37.5, 41.7, 53.8, 50.2, 48.2, 46.3, 46.5, 44.8)
mean(ages.2) # 44.58
sort(ages.2) # If you want to put them in order
median(ages.2) # 46.3

#+END_SRC

#+RESULTS:
: [1] 46.63333
: [1] 32.2 37.5 41.7 44.8 46.3 48.2 50.2 53.8 65.0
: [1] 46.3
: [1] 44.57778
: [1] 32.2 37.5 41.7 44.8 46.3 46.5 48.2 50.2 53.8
: [1] 46.3

3.5:

#+BEGIN_SRC R :session :results output :exports code

fruit <- c(1.02, 0.98, 0.91, 0.84, 0.87, 1.04, 0.79, 0.79) # We know that two are < 0.08, I arbitrarily set them to 0.079
median(fruit) # 0.89

#+END_SRC

#+RESULTS:
: [1] 0.89

